Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (64, None, 256)           17152     
_________________________________________________________________
gru (GRU)                    (64, None, 1024)          3935232   
_________________________________________________________________
dense (Dense)                (64, None, 67)            68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Epoch 1/25

1/1==============================] - 8s 8s/step - loss: 4.2047
Epoch 2/25

1/1==============================] - 7s 7s/step - loss: 4.1612
Epoch 3/25

1/1==============================] - 6s 6s/step - loss: 4.0834
Epoch 4/25

1/1==============================] - 6s 6s/step - loss: 3.6546
Epoch 5/25

1/1==============================] - 6s 6s/step - loss: 8.5406
Epoch 6/25

1/1==============================] - 7s 7s/step - loss: 5.8087
Epoch 7/25

1/1==============================] - 7s 7s/step - loss: 4.1467
Epoch 8/25

1/1==============================] - 7s 7s/step - loss: 3.4106
Epoch 9/25

1/1==============================] - 7s 7s/step - loss: 3.5854
Epoch 10/25

1/1==============================] - 7s 7s/step - loss: 3.7009
Epoch 11/25

1/1==============================] - 7s 7s/step - loss: 3.7156
Epoch 12/25

1/1==============================] - 7s 7s/step - loss: 3.6720
Epoch 13/25

1/1==============================] - 7s 7s/step - loss: 3.5994
Epoch 14/25

1/1==============================] - 7s 7s/step - loss: 3.5366
Epoch 15/25

1/1==============================] - 7s 7s/step - loss: 3.4863
Epoch 16/25

1/1==============================] - 7s 7s/step - loss: 3.4310
Epoch 17/25

1/1==============================] - 7s 7s/step - loss: 3.3758
Epoch 18/25

1/1==============================] - 7s 7s/step - loss: 3.3087
Epoch 19/25

1/1==============================] - 7s 7s/step - loss: 3.2531
Epoch 20/25

1/1==============================] - 7s 7s/step - loss: 3.1646
Epoch 21/25

1/1==============================] - 7s 7s/step - loss: 3.0868
Epoch 22/25

1/1==============================] - 7s 7s/step - loss: 3.0352
Epoch 23/25

1/1==============================] - 7s 7s/step - loss: 2.9908
Epoch 24/25

1/1==============================] - 7s 7s/step - loss: 2.9432
Epoch 25/25

1/1==============================] - 7s 7s/step - loss: 2.9109
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (1, None, 256)            17152     
_________________________________________________________________
gru_1 (GRU)                  (1, None, 1024)           3935232   
_________________________________________________________________
dense_1 (Dense)              (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_2 (Embedding)      (1, None, 256)            17152     
_________________________________________________________________
gru_2 (GRU)                  (1, None, 1024)           3935232   
_________________________________________________________________
dense_2 (Dense)              (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_3 (Embedding)      (1, None, 256)            17152     
_________________________________________________________________
gru_3 (GRU)                  (1, None, 1024)           3935232   
_________________________________________________________________
dense_3 (Dense)              (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_4 (Embedding)      (1, None, 256)            17152     
_________________________________________________________________
gru_4 (GRU)                  (1, None, 1024)           3935232   
_________________________________________________________________
dense_4 (Dense)              (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_5 (Embedding)      (1, None, 256)            17152     
_________________________________________________________________
gru_5 (GRU)                  (1, None, 1024)           3935232   
_________________________________________________________________
dense_5 (Dense)              (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_6 (Embedding)      (1, None, 256)            17152     
_________________________________________________________________
gru_6 (GRU)                  (1, None, 1024)           3935232   
_________________________________________________________________
dense_6 (Dense)              (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_7 (Embedding)      (1, None, 256)            17152     
_________________________________________________________________
gru_7 (GRU)                  (1, None, 1024)           3935232   
_________________________________________________________________
dense_7 (Dense)              (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_8 (Embedding)      (1, None, 256)            17152     
_________________________________________________________________
gru_8 (GRU)                  (1, None, 1024)           3935232   
_________________________________________________________________
dense_8 (Dense)              (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_9 (Embedding)      (1, None, 256)            17152     
_________________________________________________________________
gru_9 (GRU)                  (1, None, 1024)           3935232   
_________________________________________________________________
dense_9 (Dense)              (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_10 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_10 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_10 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_11 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_11 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_11 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_12 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_12 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_12 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_13 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_13 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_13 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_14 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_14 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_14 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_15 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_15 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_15 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_16 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_16 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_16 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_17 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_17 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_17 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_18 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_18 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_18 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_19 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_19 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_19 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_20 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_20 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_20 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_21"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_21 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_21 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_21 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_22"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_22 (Embedding)     (1, None, 256)            17152     
_________________________________________________________________
gru_22 (GRU)                 (1, None, 1024)           3935232   
_________________________________________________________________
dense_22 (Dense)             (1, None, 67)             68675     
=================================================================
Total params: 4,021,059
Trainable params: 4,021,059
Non-trainable params: 0
_________________________________________________________________
